# GetAnalyticalSurface Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisOpening..::..GetAnalyticalSurface Method
EnergyAnalysisOpening Class See Also
---
Gets the associative analytical parent surface element.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public EnergyAnalysisSurface GetAnalyticalSurface()
```

Visual Basic
---
```text
Public Function GetAnalyticalSurface As EnergyAnalysisSurface
```

Visual C++
---
```text
public:
EnergyAnalysisSurface^ GetAnalyticalSurface()
```

# ### Return Value
The associative analytical parent surface element.
# See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace